**Msds20075 Qazi Danish Ayub**

In [ ]:
%load_ext sql

In [ ]:
DB_ENDPOINT = "127.0.0.1"
DB = 'postgres1'
DB_USER = 'postgres'
DB_PASSWORD = '12345678'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres:12345678@127.0.0.1:5432/postgres1

In [ ]:
%sql $conn_string

You are provided with the following schema consisting of two tables:
1. Employees table (emp)
2. Departments table (dept)

In [ ]:
%%sql
DROP TABLE IF EXISTS emp;
DROP TABLE IF EXISTS dept;

CREATE TABLE dept (
    DEPTNO smallint PRIMARY KEY,
    DNAME VARCHAR,
    LOCATION VARCHAR
);

CREATE TABLE emp (
    EMPNO int PRIMARY KEY,
    ENAME VARCHAR,
    JOB VARCHAR,
    MANAGER int,
    HIREDATE date,
    SAL int,
    COMMISION int,
    DEPTNO smallint REFERENCES dept
);


INSERT INTO dept(DEPTNO, DNAME, LOCATION)
VALUES 
    (10, 'ACCOUNTING', 'NEW YORK'),
    (20, 'RESEARCH', 'DALLAS'),
    (30, 'SALES', 'CHICAGO'),
    (40, 'OPERATIONS', 'BOSTON');
    
INSERT INTO emp
VALUES
    (7369, 'SMITH', 'CLERK', 7902, '17-DEC-2005', 800, NULL ,20),
    (7499, 'ALLEN', 'SALESMAN', 7968, '20-FEB-2006', 1600, 300, 30),
    (7521, 'WARD', 'SALESMAN', 7968, '22-FEB-2006', 1250, 500, 30),
    (7566, 'JONES', 'MANAGER', 7839, '02-APR-2006', 2975, NULL, 20),
    (7654, 'MARTIN', 'SALESMAN', 7698, '28-SEP-2006', 1250, 1400, 30),
    (7698, 'BLAKE', 'MANAGER', 7839, '01-MAY-2006', 2850, NULL, 30),
    (7782, 'CLARK', 'MANAGER', 7839, '09-JUN-2006', 2450, NULL, 10),
    (7788, 'SCOTT', 'ANALYST', 7566, '09-DEC-2007', 3000, NULL, 20),
    (7839, 'KING', 'PRESIDENT', NULL, '17-NOV-2006', 5000, NULL, 10),
    (7844, 'TURNER', 'SALESMAN', 7698, '08-SEP-2006', 1500, 10, 30),
    (7876, 'ADAMS', 'CLERK', 7698, '12-JAN-2008', 950, NULL, 30),
    (7900, 'JAMES', 'CLERK', 7698, '03-DEC-2006', 950, NULL, 30),
    (7902, 'FORD', 'ANALYST', 7566, '03-DEC-2006', 3000, NULL, 20),
    (7934, 'MILLER', 'CLERK', 7782, '23-JAN-2007', 1300, NULL, 10);

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
Done.
Done.
Done.
Done.
4 rows affected.
14 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM dept;

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
4 rows affected.

[(10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')]

In [ ]:
%%sql
SELECT * FROM emp;

 * postgresql://postgres:***@127.0.0.1:5432/postgres
14 rows affected.

[(7369, 'SMITH', 'CLERK', 7902, datetime.date(2005, 12, 17), 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7968, datetime.date(2006, 2, 20), 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7968, datetime.date(2006, 2, 22), 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, datetime.date(2006, 4, 2), 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(2006, 9, 28), 1250, 1400, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(2007, 12, 9), 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(2006, 9, 8), 1500, 10, 30),
 (7876, 'ADAMS', 'CLERK', 7698, datetime.date(2008, 1, 12), 950, None, 30),
 (7900, 'JAMES', 'CLERK', 7698, datetime.date(2006, 12, 3), 950, None, 30),
 (7902, 'FORD', 'ANALYST', 7566, datetime.date(2006, 12, 3), 3000, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 1300, None, 10)]

Write queries to perform the following tasks

Q1) Show names of those employees who have a job title ending with 'ER'

In [ ]:
%%sql
SELECT ENAME from emp where job like '%ER'

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
3 rows affected.

[('JONES',), ('BLAKE',), ('CLARK',)]

Q2) Show names of those employees who work in either ACCOUNTING or RESEARCH

In [ ]:
%%sql
Select ENAME from emp e
JOIN dept d ON e.deptno = d.deptno
where d.dname IN('ACCOUNTING','RESEARCH')

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
7 rows affected.

[('SMITH',),
 ('JONES',),
 ('CLARK',),
 ('SCOTT',),
 ('KING',),
 ('FORD',),
 ('MILLER',)]

Q3) Create a query which displays employees from department 10, along with their deptno stacked on top of all department names along with their department numbers.
Output of the query is displayed below

| ENAME_AND_DNAME | DEPTNO |
|-----------------|--------|
| CLARK           | 10     |
| KING            | 10     |
| MILLER          | 10     |
|                 |        |
| ACCOUNTING      | 10     |
| RESEARCH        | 20     |
| SALES           | 30     |
| OPERATIONS      | 40     |

In [ ]:
%%sql
Select ENAME, d.deptno from emp e
JOIN dept d ON e.deptno = d.deptno
where d.deptno=10
UNION ALL

Select d.dname,d.deptno from emp e
JOIN dept d ON e.deptno = d.deptno
group by d.deptno

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
6 rows affected.

[('CLARK', 10),
 ('KING', 10),
 ('MILLER', 10),
 ('ACCOUNTING', 10),
 ('SALES', 30),
 ('RESEARCH', 20)]

Q4) Find the department which has no employees

In [ ]:
%%sql
Select ENAME, d.deptno from emp e
JOIN dept d ON e.deptno = d.deptno
where d.deptno=10

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
3 rows affected.

[('CLARK', 10), ('KING', 10), ('MILLER', 10)]

Q5) Display employee names along with their salaries in ascending order

In [ ]:
%%sql
select ENAME,SAL from emp ORDER BY sal

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
14 rows affected.

[('SMITH', 800),
 ('ADAMS', 950),
 ('JAMES', 950),
 ('WARD', 1250),
 ('MARTIN', 1250),
 ('MILLER', 1300),
 ('TURNER', 1500),
 ('ALLEN', 1600),
 ('CLARK', 2450),
 ('BLAKE', 2850),
 ('JONES', 2975),
 ('FORD', 3000),
 ('SCOTT', 3000),
 ('KING', 5000)]

Q6) Find the total salary by department

In [ ]:
%%sql
Select dname,sum(sal) from emp e
JOIN dept d ON e.deptno = d.deptno
group by d.deptno

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
3 rows affected.

[('ACCOUNTING', 8750), ('SALES', 10350), ('RESEARCH', 9775)]

Q7) Find the salary of the manager of ALLEN

In [ ]:
%%sql
Select sal from emp where job = "MANAGER" && manager = 7968

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
(psycopg2.errors.SyntaxError) syntax error at or near "="
LINE 1: Select sal from emp where job = "MANAGER" && manager = 7968
                                                             ^

[SQL: Select sal from emp where job = "MANAGER" && manager = 7968]
(Background on this error at: http://sqlalche.me/e/f405)

Q8) Insert a new department named PROGRAMMING with deptno 50 and location in BALTIMORE

In [ ]:
%%sql
INSERT INTO dept(DEPTNO, DNAME, LOCATION)
VALUES 
    (50, 'Programming', 'BALTIMORE');

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
1 rows affected.

[]

Q9) Find the number of days between the hiredates of WARD and ALLEN

In [ ]:
%%sql

Q10) Find the oldest employee at the company

In [ ]:
%%sql
Select * from emp Where HIREDATE == MIN(HIREDATE)

 * postgresql://postgres:***@127.0.0.1:5432/postgres1
(psycopg2.errors.GroupingError) aggregate functions are not allowed in WHERE
LINE 1: Select * from emp Where HIREDATE == MIN(HIREDATE)
                                            ^

[SQL: Select * from emp Where HIREDATE == MIN(HIREDATE)]
(Background on this error at: http://sqlalche.me/e/f405)